In [3]:
import pandas as pd

df = pd.read_csv('panda3.csv')

df

  tickers            eps  revenue price         people
0  Google          27.82       87    12     Larry page
1     WMT           34.1     -122    23            N.A
2    MSFT          12.56      343    64     Bill gates
3     RIL           32.1       22  1023  Mukesh ambani
4    Tata  not available      190   N.A     Ratan tata

--> It will skip the first row

-->Both are work same

df = pd.read_csv('panda3.csv', header=1)
df = pd.read_csv('panda3.csv', skiprow=1)

--> It is use for set the header name
--> If header is none then it takes 0,1,2,3...

df = pd.read_csv('panda3.csv', header=None, names=["ticker","eps","revenue","price","people")

In [4]:
# it replace not available to NaN
df = pd.read_csv('panda3.csv', na_values=["not available", "N.A"])
df

  tickers    eps  revenue   price         people
0  Google  27.82       87    12.0     Larry page
1     WMT  34.10     -122    23.0            NaN
2    MSFT  12.56      343    64.0     Bill gates
3     RIL  32.10       22  1023.0  Mukesh ambani
4    Tata    NaN      190     NaN     Ratan tata

In [6]:
# To make another csv file
# index as a false it removes the first column
df.to_csv('new.csv', index=False)

In [8]:
# To get only particular columns in new file
# To remove the header from the file
df.to_csv('new.csv',columns=['eps'], index=False, header=False)